---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationWarning
source: html/818b33ec-b895-8b54-0c63-e16fcc9cae3b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationWarning Property

Cannot create specified fillet at rail path corner.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailFilletCreationWarning { get; }
```